app/controllers/prelaunch_controller.rb

SELECT 1 AS one FROM "prelaunch_users" WHERE "prelaunch_users"."email" = 'ketay99@gmail.com' LIMIT 1
INSERT INTO "prelaunch_users" ("created_at", "email", "telephone_number", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 Oct 2013 10:11:48 UTC +00:00], ["email", "ketay99@gmail.com"], ["telephone_number", "0206242008"], ["updated_at", Sun, 13 Oct 2013 10:11:48 UTC +00:00]]
---
  def create
  	@prelaunch = PrelaunchUser.new(params[:prelaunch_user])
  	if PrelaunchUser.exists? :email=>@prelaunch.email
  		flash[:alert] = "Entry already made, phone number would be updated."
  		redirect_to root_url
  	else
  		if @prelaunch.save

SELECT "faqs".* FROM "faqs"
---
  def faq
    @faq = Faq.all